simulations/lift-drag/mach4/alpha1/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       csv;

writeControl    writeTime; // this ensures that it's writing only at writeInterval
purgeWrite 2;

sets
(

    // make sure to change (x1 y1 z1) and (x2 y2 z2) to
    // the coordinates of the start and end points

    surface1 
    {
        type    lineUniform;
        axis    xyz;
        start   (-2.9995 -0.0523 0);
        end     (-0.0052 0.3 0);
        nPoints 1000;
    }
    surface2 
    {
        type    lineUniform;
        axis    xyz;
        start   (-0.0052 0.3 0);
        end     (2.9995 0.0524 0);
        nPoints 1000;
    }
    surface3 
    {
        type    lineUniform;
        axis    xyz;
        start   (2.9995 0.0523 0);
        end     (0.0052 -0.3 0);
        nPoints 1000;
    }
    surface4 
    {
        type    lineUniform;
        axis    xyz;
        start   (-2.9995 -0.0524 0);
        end     (0.0052 -0.3 0);
        nPoints 1000;
    }
);

fields          (p);


// ************************************************************************* //